XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/dma_uart.c
/**
 * @file    dma_uart.c
 * @author  Deadline039
 * @brief   使用DMA+半满中断+满中断+空闲中断实现高可靠串口数据收发
 * @version 1.0
 * @date    2024-01-21
 * @note    不使用硬件FIFO, 仅有4字节大小不满足要求
 * @see     https://github.com/Prry/stm32-uart-dma
 * @see     https://gitee.com/wei513723/stm32-stable-uart-transmit-receive
 */

#include "dma_uart.h"

/*******************************************************************************
 * @defgroup 串口1 DMA
 * @{
 */

#ifdef EN_USART1

    #if USART1_USE_DMA_TX

static DMA_HandleTypeDef USART1_DMA_TX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_tx_fifo_t g_usart1_tx_fifo = {0};
static uint8_t *g_usart1_send_buf;

/**
 * @brief 串口1 DMA发送初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 * @warning `fifo_size`必须是2的幂次方
 */
void USART1_TX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_usart1_send_buf = (uint8_t *)malloc((sizeof(uint8_t)) * buf_size);
    g_usart1_tx_fifo.send_buf = g_usart1_send_buf;
    g_usart1_tx_fifo.send_buf_size = buf_size;
    g_usart1_tx_fifo.tc_flag = 1;
    g_usart1_tx_fifo.tx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));

    g_usart1_tx_fifo.tx_fifo =
        ring_fifo_init(g_usart1_tx_fifo.tx_fifo_buf, fifo_size, RF_TYPE_STREAM);
    if (g_usart1_tx_fifo.tx_fifo_buf == NULL) {
        printf("USART1 TX FIFO Init Failed. \r\n");
        while (1)
            ;
    }

    __HAL_RCC_DMA2_CLK_ENABLE();

    USART1_DMA_TX_Handler.Instance = DMA2_Stream7;
    USART1_DMA_TX_Handler.Init.Channel = DMA_CHANNEL_4;
    USART1_DMA_TX_Handler.Init.Direction =
        DMA_MEMORY_TO_PERIPH; /* 发送, 内存到外设 */
    USART1_DMA_TX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    USART1_DMA_TX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    USART1_DMA_TX_Handler.Init.Mode = DMA_NORMAL;
    USART1_DMA_TX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    USART1_DMA_TX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    USART1_DMA_TX_Handler.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&USART1_DMA_TX_Handler);
    __HAL_LINKDMA(&USART1_Handler, hdmatx, USART1_DMA_TX_Handler);

    HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);
}

/**
 * @brief 串口1发送中断句柄
 *
 */
void DMA2_Stream7_IRQHandler(void) {
    HAL_DMA_IRQHandler(&USART1_DMA_TX_Handler);
}
    #endif /* USART1_USE_DMA_TX */

    #if USART1_USE_DMA_RX

static DMA_HandleTypeDef USART1_DMA_RX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_rx_fifo_t g_usart1_rx_fifo = {0};
static uint8_t *g_usart1_recv_buf;

/**
 * @brief 串口1接收DMA初始化
 *
 * @param fifo_size FIFO大小
 * @param buf_size 缓冲区大小
 */
void USART1_RX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_usart1_recv_buf = (uint8_t *)malloc((sizeof(uint8_t)) * (buf_size));
    g_usart1_rx_fifo.head_ptr = 0;
    g_usart1_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));
    g_usart1_rx_fifo.rx_fifo =
        ring_fifo_init(g_usart1_rx_fifo.rx_fifo_buf,
                       (sizeof(uint8_t)) * (fifo_size), RF_TYPE_STREAM);
    if (g_usart1_rx_fifo.rx_fifo == NULL) {
        printf("USART1 RX FIFO Init Failed. \r\n");
        while (1)
            ;
    }
    __HAL_RCC_DMA2_CLK_ENABLE();

    USART1_DMA_RX_Handler.Instance = DMA2_Stream5;
    USART1_DMA_RX_Handler.Init.Channel = DMA_CHANNEL_4;
    USART1_DMA_RX_Handler.Init.Direction =
        DMA_PERIPH_TO_MEMORY; /* 接收, 外设到内存 */
    USART1_DMA_RX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    USART1_DMA_RX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    USART1_DMA_RX_Handler.Init.Mode = DMA_CIRCULAR;
    USART1_DMA_RX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    USART1_DMA_RX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    USART1_DMA_RX_Handler.Init.Priority = DMA_PRIORITY_HIGH;

    HAL_DMA_Init(&USART1_DMA_RX_Handler);
    __HAL_LINKDMA(&USART1_Handler, hdmarx, USART1_DMA_RX_Handler);

    HAL_NVIC_SetPriority(DMA2_Stream5_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream5_IRQn);

        #if USART1_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&USART1_Handler, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&USART1_Handler);
        #endif /* USART1_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&USART1_Handler, (uint8_t *)g_usart1_recv_buf,
                         buf_size);
}

/**
 * @brief 串口1接收中断句柄
 *
 */
void DMA2_Stream5_IRQHandler(void) {
    HAL_DMA_IRQHandler(&USART1_DMA_RX_Handler);
}
    #endif /* USART1_USE_DMA_RX */

#endif /* EN_USART1 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口2 DMA
 * @{
 */

#ifdef EN_USART2

    #if USART2_USE_DMA_TX

static DMA_HandleTypeDef USART2_DMA_TX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_tx_fifo_t g_usart2_tx_fifo = {0};
static uint8_t *g_usart2_send_buf;

/**
 * @brief 串口2发送DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 * @warning `fifo_size`必须是2的幂次方
 */
void USART2_TX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_usart2_send_buf = (uint8_t *)malloc((sizeof(uint8_t)) * buf_size);
    g_usart2_tx_fifo.send_buf = g_usart2_send_buf;
    g_usart2_tx_fifo.send_buf_size = buf_size;
    g_usart2_tx_fifo.tc_flag = 1;
    g_usart2_tx_fifo.tx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));

    g_usart2_tx_fifo.tx_fifo =
        ring_fifo_init(g_usart2_tx_fifo.tx_fifo_buf, fifo_size, RF_TYPE_STREAM);
    if (g_usart2_tx_fifo.tx_fifo_buf == NULL) {
        printf("USART2 TX FIFO Init Failed. \r\n");
        while (1)
            ;
    }

    __HAL_RCC_DMA1_CLK_ENABLE();
    USART2_DMA_TX_Handler.Instance = DMA1_Stream6;
    USART2_DMA_TX_Handler.Init.Channel = DMA_CHANNEL_4;
    USART2_DMA_TX_Handler.Init.Direction =
        DMA_MEMORY_TO_PERIPH; /* 发送, 内存到外设 */
    USART2_DMA_TX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    USART2_DMA_TX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    USART2_DMA_TX_Handler.Init.Mode = DMA_NORMAL;
    USART2_DMA_TX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    USART2_DMA_TX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    USART2_DMA_TX_Handler.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&USART2_DMA_TX_Handler);
    __HAL_LINKDMA(&USART2_Handler, hdmatx, USART2_DMA_TX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);
}

/**
 * @brief 串口2发送中断句柄
 *
 */
void DMA1_Stream6_IRQHandler(void) {
    HAL_DMA_IRQHandler(&USART2_DMA_TX_Handler);
}
    #endif /* USART2_USE_DMA_TX */

    #if USART2_USE_DMA_RX

static DMA_HandleTypeDef USART2_DMA_RX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_rx_fifo_t g_usart2_rx_fifo = {0};
static uint8_t *g_usart2_recv_buf;

/**
 * @brief 串口2接收DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 */
void USART2_RX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_usart2_recv_buf = (uint8_t *)malloc((sizeof(uint8_t)) * (buf_size));
    g_usart2_rx_fifo.head_ptr = 0;
    g_usart2_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));
    g_usart2_rx_fifo.rx_fifo =
        ring_fifo_init(g_usart2_rx_fifo.rx_fifo_buf,
                       (sizeof(uint8_t)) * (fifo_size), RF_TYPE_STREAM);
    if (g_usart2_rx_fifo.rx_fifo == NULL) {
        printf("USART2 RX FIFO Init Failed. \r\n");
        while (1)
            ;
    }
    __HAL_RCC_DMA1_CLK_ENABLE();

    USART2_DMA_RX_Handler.Instance = DMA1_Stream5;
    USART2_DMA_RX_Handler.Init.Channel = DMA_CHANNEL_4;
    USART2_DMA_RX_Handler.Init.Direction =
        DMA_PERIPH_TO_MEMORY; /* 接收, 外设到内存 */
    USART2_DMA_RX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    USART2_DMA_RX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    USART2_DMA_RX_Handler.Init.Mode = DMA_CIRCULAR;
    USART2_DMA_RX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    USART2_DMA_RX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    USART2_DMA_RX_Handler.Init.Priority = DMA_PRIORITY_HIGH;

    HAL_DMA_Init(&USART2_DMA_RX_Handler);
    __HAL_LINKDMA(&USART2_Handler, hdmarx, USART2_DMA_RX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);

        #if USART2_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&USART2_Handler, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&USART2_Handler);
        #endif /* USART2_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&USART2_Handler, (uint8_t *)g_usart2_recv_buf,
                         buf_size);
}

/**
 * @brief 串口2接收中断句柄
 *
 */
void DMA1_Stream5_IRQHandler(void) {
    HAL_DMA_IRQHandler(&USART2_DMA_RX_Handler);
}
    #endif /* USART2_USE_DMA_RX */

#endif /* EN_USART2 */

/**
 * @}
 */

