XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/dma_uart.c
/*******************************************************************************
 * @defgroup 串口3 DMA
 * @{
 */

#ifdef EN_USART3

    #if USART3_USE_DMA_TX

static DMA_HandleTypeDef USART3_DMA_TX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_tx_fifo_t g_usart3_tx_fifo = {0};
static uint8_t *g_usart3_send_buf;

/**
 * @brief 串口3发送DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 * @warning `fifo_size`必须是2的幂次方
 */
void USART3_TX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_usart3_send_buf = (uint8_t *)malloc((sizeof(uint8_t)) * buf_size);
    g_usart3_tx_fifo.send_buf = g_usart3_send_buf;
    g_usart3_tx_fifo.send_buf_size = buf_size;
    g_usart3_tx_fifo.tc_flag = 1;
    g_usart3_tx_fifo.tx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));

    g_usart3_tx_fifo.tx_fifo =
        ring_fifo_init(g_usart3_tx_fifo.tx_fifo_buf, fifo_size, RF_TYPE_STREAM);
    if (g_usart3_tx_fifo.tx_fifo_buf == NULL) {
        printf("USART3 TX FIFO Init Failed. \r\n");
        while (1)
            ;
    }

    __HAL_RCC_DMA1_CLK_ENABLE();
    USART3_DMA_TX_Handler.Instance = DMA1_Stream3;
    USART3_DMA_TX_Handler.Init.Channel = DMA_CHANNEL_4;
    USART3_DMA_TX_Handler.Init.Direction =
        DMA_MEMORY_TO_PERIPH; /* 发送, 内存到外设 */
    USART3_DMA_TX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    USART3_DMA_TX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    USART3_DMA_TX_Handler.Init.Mode = DMA_NORMAL;
    USART3_DMA_TX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    USART3_DMA_TX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    USART3_DMA_TX_Handler.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&USART3_DMA_TX_Handler);
    __HAL_LINKDMA(&USART3_Handler, hdmatx, USART3_DMA_TX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
}

/**
 * @brief 串口3发送中断句柄
 *
 */
void DMA1_Stream3_IRQHandler(void) {
    HAL_DMA_IRQHandler(&USART3_DMA_TX_Handler);
}
    #endif /* USART3_USE_DMA_TX */

    #if USART3_USE_DMA_RX

static DMA_HandleTypeDef USART3_DMA_RX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_rx_fifo_t g_usart3_rx_fifo = {0};
static uint8_t *g_usart3_recv_buf;

/**
 * @brief 串口3接收DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 */
void USART3_RX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_usart3_recv_buf = (uint8_t *)malloc((sizeof(uint8_t)) * (buf_size));
    g_usart3_rx_fifo.head_ptr = 0;
    g_usart3_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));
    g_usart3_rx_fifo.rx_fifo =
        ring_fifo_init(g_usart3_rx_fifo.rx_fifo_buf,
                       (sizeof(uint8_t)) * (fifo_size), RF_TYPE_STREAM);
    if (g_usart3_rx_fifo.rx_fifo == NULL) {
        printf("USART3 RX FIFO Init Failed. \r\n");
        while (1)
            ;
    }

    __HAL_RCC_DMA1_CLK_ENABLE();

    USART3_DMA_RX_Handler.Instance = DMA1_Stream1;
    USART3_DMA_RX_Handler.Init.Channel = DMA_CHANNEL_4;
    USART3_DMA_RX_Handler.Init.Direction =
        DMA_PERIPH_TO_MEMORY; /* 接收, 外设到内存 */
    USART3_DMA_RX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    USART3_DMA_RX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    USART3_DMA_RX_Handler.Init.Mode = DMA_CIRCULAR;
    USART3_DMA_RX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    USART3_DMA_RX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    USART3_DMA_RX_Handler.Init.Priority = DMA_PRIORITY_HIGH;

    HAL_DMA_Init(&USART3_DMA_RX_Handler);
    __HAL_LINKDMA(&USART3_Handler, hdmarx, USART3_DMA_RX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);

        #if USART3_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&USART3_Handler, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&USART3_Handler);
        #endif /* USART3_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&USART3_Handler, (uint8_t *)g_usart3_recv_buf,
                         buf_size);
}
/**
 * @brief 串口3接收中断句柄
 *
 */
void DMA1_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&USART3_DMA_RX_Handler);
}
    #endif /* USART3_USE_DMA_RX */

#endif /* EN_USART3 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口4 DMA
 * @{
 */

#ifdef EN_UART4

    #if UART4_USE_DMA_TX

static DMA_HandleTypeDef UART4_DMA_TX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_tx_fifo_t g_uart4_tx_fifo = {0};
static uint8_t *g_uart4_send_buf;

/**
 * @brief 串口4发送DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 * @warning `fifo_size`必须是2的幂次方
 */
void UART4_TX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_uart4_send_buf = (uint8_t *)malloc((sizeof(uint8_t)) * buf_size);
    g_uart4_tx_fifo.send_buf = g_uart4_send_buf;
    g_uart4_tx_fifo.send_buf_size = buf_size;
    g_uart4_tx_fifo.tc_flag = 1;
    g_uart4_tx_fifo.tx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));

    g_uart4_tx_fifo.tx_fifo =
        ring_fifo_init(g_uart4_tx_fifo.tx_fifo_buf, fifo_size, RF_TYPE_STREAM);
    if (g_uart4_tx_fifo.tx_fifo_buf == NULL) {
        printf("UART4 TX FIFO Init Failed. \r\n");
        while (1)
            ;
    }

    __HAL_RCC_DMA1_CLK_ENABLE();
    UART4_DMA_TX_Handler.Instance = DMA1_Stream4;
    UART4_DMA_TX_Handler.Init.Channel = DMA_CHANNEL_4;
    UART4_DMA_TX_Handler.Init.Direction =
        DMA_MEMORY_TO_PERIPH; /* 发送, 内存到外设 */
    UART4_DMA_TX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    UART4_DMA_TX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    UART4_DMA_TX_Handler.Init.Mode = DMA_NORMAL;
    UART4_DMA_TX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    UART4_DMA_TX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    UART4_DMA_TX_Handler.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&UART4_DMA_TX_Handler);
    __HAL_LINKDMA(&UART4_Handler, hdmatx, UART4_DMA_TX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);
}
/**
 * @brief 串口4发送中断句柄
 *
 */
void DMA1_Stream4_IRQHandler(void) {
    HAL_DMA_IRQHandler(&UART4_DMA_TX_Handler);
}
    #endif /* UART4_USE_DMA_TX */

