XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/dma_uart.c
    #if UART4_USE_DMA_RX
static DMA_HandleTypeDef UART4_DMA_RX_Handler = {0};

/* FIFO+BUF, 双缓冲 */
static uart_rx_fifo_t g_uart4_rx_fifo = {0};
static uint8_t *g_uart4_recv_buf;

/**
 * @brief 串口4接收DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 */
void UART4_RX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_uart4_recv_buf = (uint8_t *)malloc((sizeof(uint8_t)) * (buf_size));
    g_uart4_rx_fifo.head_ptr = 0;
    g_uart4_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));
    g_uart4_rx_fifo.rx_fifo =
        ring_fifo_init(g_uart4_rx_fifo.rx_fifo_buf,
                       (sizeof(uint8_t)) * (fifo_size), RF_TYPE_STREAM);
    if (g_uart4_rx_fifo.rx_fifo == NULL) {
        printf("UART4 RX FIFO Init Failed. \r\n");
        while (1)
            ;
    }
    __HAL_RCC_DMA1_CLK_ENABLE();

    UART4_DMA_RX_Handler.Instance = DMA1_Stream2;
    UART4_DMA_RX_Handler.Init.Channel = DMA_CHANNEL_4;
    UART4_DMA_RX_Handler.Init.Direction =
        DMA_PERIPH_TO_MEMORY; /* 接收, 外设到内存 */
    UART4_DMA_RX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    UART4_DMA_RX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    UART4_DMA_RX_Handler.Init.Mode = DMA_CIRCULAR;
    UART4_DMA_RX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    UART4_DMA_RX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    UART4_DMA_RX_Handler.Init.Priority = DMA_PRIORITY_HIGH;

    HAL_DMA_Init(&UART4_DMA_RX_Handler);
    __HAL_LINKDMA(&UART4_Handler, hdmarx, UART4_DMA_RX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);

        #if UART4_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&UART4_Handler, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&UART4_Handler);
        #endif /* UART4_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&UART4_Handler, (uint8_t *)g_uart4_recv_buf, buf_size);
}

/**
 * @brief 串口4接收中断句柄
 *
 */
void DMA1_Stream2_IRQHandler(void) {
    HAL_DMA_IRQHandler(&UART4_DMA_RX_Handler);
}
    #endif /* UART4_USE_DMA_RX */

#endif /* EN_UART4 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口5 DMA
 * @{
 */

#ifdef EN_UART5

    #if UART5_USE_DMA_TX

static DMA_HandleTypeDef UART5_DMA_TX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_tx_fifo_t g_uart5_tx_fifo = {0};
static uint8_t *g_uart5_send_buf;

/**
 * @brief 串口5发送DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 * @warning `fifo_size`必须是2的幂次方
 */
void UART5_TX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_uart5_send_buf = (uint8_t *)malloc((sizeof(uint8_t)) * buf_size);
    g_uart5_tx_fifo.send_buf = g_uart5_send_buf;
    g_uart5_tx_fifo.send_buf_size = buf_size;
    g_uart5_tx_fifo.tc_flag = 1;
    g_uart5_tx_fifo.tx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));

    g_uart5_tx_fifo.tx_fifo =
        ring_fifo_init(g_uart5_tx_fifo.tx_fifo_buf, fifo_size, RF_TYPE_STREAM);
    if (g_uart5_tx_fifo.tx_fifo_buf == NULL) {
        printf("UART5 TX FIFO Init Failed. \r\n");
        while (1)
            ;
    }

    __HAL_RCC_DMA1_CLK_ENABLE();
    UART5_DMA_TX_Handler.Instance = DMA1_Stream7;
    UART5_DMA_TX_Handler.Init.Channel = DMA_CHANNEL_4;
    UART5_DMA_TX_Handler.Init.Direction =
        DMA_MEMORY_TO_PERIPH; /* 发送, 内存到外设 */
    UART5_DMA_TX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    UART5_DMA_TX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    UART5_DMA_TX_Handler.Init.Mode = DMA_NORMAL;
    UART5_DMA_TX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    UART5_DMA_TX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    UART5_DMA_TX_Handler.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&UART5_DMA_TX_Handler);
    __HAL_LINKDMA(&UART5_Handler, hdmatx, UART5_DMA_TX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);
}
/**
 * @brief 串口5发送中断句柄
 *
 */
void DMA1_Stream7_IRQHandler(void) {
    HAL_DMA_IRQHandler(&UART5_DMA_TX_Handler);
}
    #endif /* UART5_USE_DMA_TX */

    #if UART5_USE_DMA_RX

static DMA_HandleTypeDef UART5_DMA_RX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_rx_fifo_t g_uart5_rx_fifo = {0};
static uint8_t *g_uart5_recv_buf;

/**
 * @brief 串口5接收DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 */
void UART5_RX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_uart5_recv_buf = (uint8_t *)malloc((sizeof(uint8_t)) * (buf_size));
    g_uart5_rx_fifo.head_ptr = 0;
    g_uart5_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));
    g_uart5_rx_fifo.rx_fifo =
        ring_fifo_init(g_uart5_rx_fifo.rx_fifo_buf,
                       (sizeof(uint8_t)) * (fifo_size), RF_TYPE_STREAM);
    if (g_uart5_rx_fifo.rx_fifo == NULL) {
        printf("UART5 RX FIFO Init Failed. \r\n");
        while (1)
            ;
    }
    __HAL_RCC_DMA1_CLK_ENABLE();

    UART5_DMA_RX_Handler.Instance = DMA1_Stream0;
    UART5_DMA_RX_Handler.Init.Channel = DMA_CHANNEL_4;
    UART5_DMA_RX_Handler.Init.Direction =
        DMA_PERIPH_TO_MEMORY; /* 接收, 外设到内存 */
    UART5_DMA_RX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    UART5_DMA_RX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    UART5_DMA_RX_Handler.Init.Mode = DMA_CIRCULAR;
    UART5_DMA_RX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    UART5_DMA_RX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    UART5_DMA_RX_Handler.Init.Priority = DMA_PRIORITY_HIGH;

    HAL_DMA_Init(&UART5_DMA_RX_Handler);
    __HAL_LINKDMA(&UART5_Handler, hdmarx, UART5_DMA_RX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);

        #if UART5_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&UART5_Handler, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&UART5_Handler);
        #endif /* UART5_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&UART5_Handler, (uint8_t *)g_uart5_recv_buf, buf_size);
}

/**
 * @brief 串口5接收中断句柄
 *
 */
void DMA1_Stream0_IRQHandler(void) {
    HAL_DMA_IRQHandler(&UART5_DMA_RX_Handler);
}
    #endif /* UART5_USE_DMA_RX */

#endif /* EN_UART5 */

/**
 * @}
 */

