XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/dma_uart.c
/*******************************************************************************
 * @defgroup 串口6 DMA
 * @{
 */

#ifdef EN_USART6

static DMA_HandleTypeDef USART6_DMA_TX_Handler = {0};
static uart_tx_fifo_t g_usart6_tx_fifo = {0};
static uint8_t *g_usart6_send_buf;

    #if USART6_USE_DMA_TX

/**
 * @brief 串口6 DMA发送初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 * @warning `fifo_size`必须是2的幂次方
 */
void USART6_TX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_usart6_send_buf = (uint8_t *)malloc((sizeof(uint8_t)) * buf_size);
    g_usart6_tx_fifo.send_buf = g_usart6_send_buf;
    g_usart6_tx_fifo.send_buf_size = buf_size;
    g_usart6_tx_fifo.tc_flag = 1;
    g_usart6_tx_fifo.tx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));

    g_usart6_tx_fifo.tx_fifo =
        ring_fifo_init(g_usart6_tx_fifo.tx_fifo_buf, fifo_size, RF_TYPE_STREAM);
    if (g_usart6_tx_fifo.tx_fifo_buf == NULL) {
        printf("USART6 TX FIFO Init Failed. \r\n");
        while (1)
            ;
    }

    __HAL_RCC_DMA2_CLK_ENABLE();

    USART6_DMA_TX_Handler.Instance = DMA2_Stream6;
    USART6_DMA_TX_Handler.Init.Channel = DMA_CHANNEL_5;
    USART6_DMA_TX_Handler.Init.Direction =
        DMA_MEMORY_TO_PERIPH; /* 发送, 内存到外设 */
    USART6_DMA_TX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    USART6_DMA_TX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    USART6_DMA_TX_Handler.Init.Mode = DMA_NORMAL;
    USART6_DMA_TX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    USART6_DMA_TX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    USART6_DMA_TX_Handler.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&USART6_DMA_TX_Handler);
    __HAL_LINKDMA(&USART6_Handler, hdmatx, USART6_DMA_TX_Handler);

    HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);
}

/**
 * @brief 串口6发送中断句柄
 *
 */
void DMA2_Stream6_IRQHandler(void) {
    HAL_DMA_IRQHandler(&USART6_DMA_TX_Handler);
}
    #endif /* USART6_USE_DMA_TX */

    #if USART6_USE_DMA_RX

static DMA_HandleTypeDef USART6_DMA_RX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_rx_fifo_t g_usart6_rx_fifo = {0};
static uint8_t *g_usart6_recv_buf;

/**
 * @brief 串口6接收DMA初始化
 *
 * @param fifo_size FIFO大小
 * @param buf_size 缓冲区大小
 */
void USART6_RX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_usart6_recv_buf = (uint8_t *)malloc((sizeof(uint8_t)) * (buf_size));
    g_usart6_rx_fifo.head_ptr = 0;
    g_usart6_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));
    g_usart6_rx_fifo.rx_fifo =
        ring_fifo_init(g_usart6_rx_fifo.rx_fifo_buf,
                       (sizeof(uint8_t)) * (fifo_size), RF_TYPE_STREAM);
    if (g_usart6_rx_fifo.rx_fifo == NULL) {
        printf("USART6 RX FIFO Init Failed. \r\n");
        while (1)
            ;
    }
    __HAL_RCC_DMA2_CLK_ENABLE();

    USART6_DMA_RX_Handler.Instance = DMA2_Stream1;
    USART6_DMA_RX_Handler.Init.Channel = DMA_CHANNEL_5;
    USART6_DMA_RX_Handler.Init.Direction =
        DMA_PERIPH_TO_MEMORY; /* 接收, 外设到内存 */
    USART6_DMA_RX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    USART6_DMA_RX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    USART6_DMA_RX_Handler.Init.Mode = DMA_CIRCULAR;
    USART6_DMA_RX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    USART6_DMA_RX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    USART6_DMA_RX_Handler.Init.Priority = DMA_PRIORITY_HIGH;

    HAL_DMA_Init(&USART6_DMA_RX_Handler);
    __HAL_LINKDMA(&USART6_Handler, hdmarx, USART6_DMA_RX_Handler);

    HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);

        #if USART6_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&USART6_Handler, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&USART6_Handler);
        #endif /* USART6_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&USART6_Handler, (uint8_t *)g_usart6_recv_buf,
                         buf_size);
}

/**
 * @brief 串口6接收中断句柄
 *
 */
void DMA2_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&USART6_DMA_RX_Handler);
}
    #endif /* USART6_USE_DMA_RX */

#endif /* EN_USART6 */

/**
 * @}
 */

#if (defined(STM32F429xx) || defined(STM32F439xx))

/*******************************************************************************
 * @defgroup 串口7 DMA
 * @{
 */

    #ifdef EN_UART7

        #if UART7_USE_DMA_TX

static DMA_HandleTypeDef UART7_DMA_TX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_tx_fifo_t g_uart7_tx_fifo = {0};
static uint8_t *g_uart7_send_buf;

/**
 * @brief 串口7发送DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 * @warning `fifo_size`必须是2的幂次方
 */
void UART7_TX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_uart7_send_buf = (uint8_t *)malloc((sizeof(uint8_t)) * buf_size);
    g_uart7_tx_fifo.send_buf = g_uart7_send_buf;
    g_uart7_tx_fifo.send_buf_size = buf_size;
    g_uart7_tx_fifo.tc_flag = 1;
    g_uart7_tx_fifo.tx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));

    g_uart7_tx_fifo.tx_fifo =
        ring_fifo_init(g_uart7_tx_fifo.tx_fifo_buf, fifo_size, RF_TYPE_STREAM);
    if (g_uart7_tx_fifo.tx_fifo_buf == NULL) {
        printf("UART7 TX FIFO Init Failed. \r\n");
        while (1)
            ;
    }

    __HAL_RCC_DMA1_CLK_ENABLE();
    UART7_DMA_TX_Handler.Instance = DMA1_Stream1;
    UART7_DMA_TX_Handler.Init.Channel = DMA_CHANNEL_5;
    UART7_DMA_TX_Handler.Init.Direction =
        DMA_MEMORY_TO_PERIPH; /* 发送, 内存到外设 */
    UART7_DMA_TX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    UART7_DMA_TX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    UART7_DMA_TX_Handler.Init.Mode = DMA_NORMAL;
    UART7_DMA_TX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    UART7_DMA_TX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    UART7_DMA_TX_Handler.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&UART7_DMA_TX_Handler);
    __HAL_LINKDMA(&UART7_Handler, hdmatx, UART7_DMA_TX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);
}
/**
 * @brief 串口7发送中断句柄
 *
 */
void DMA1_Stream1_IRQHandler(void) {
    HAL_DMA_IRQHandler(&UART7_DMA_TX_Handler);
}
        #endif /* UART7_USE_DMA_TX */

