XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/dma_uart.c
        #if UART7_USE_DMA_RX

static DMA_HandleTypeDef UART7_DMA_RX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_rx_fifo_t g_uart7_rx_fifo = {0};
static uint8_t *g_uart7_recv_buf;

/**
 * @brief 串口7接收DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 */
void UART7_RX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_uart7_recv_buf = (uint8_t *)malloc((sizeof(uint8_t)) * (buf_size));
    g_uart7_rx_fifo.head_ptr = 0;
    g_uart7_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));
    g_uart7_rx_fifo.rx_fifo =
        ring_fifo_init(g_uart7_rx_fifo.rx_fifo_buf,
                       (sizeof(uint8_t)) * (fifo_size), RF_TYPE_STREAM);
    if (g_uart7_rx_fifo.rx_fifo == NULL) {
        printf("UART7 RX FIFO Init Failed. \r\n");
        while (1)
            ;
    }
    __HAL_RCC_DMA1_CLK_ENABLE();

    UART7_DMA_RX_Handler.Instance = DMA1_Stream3;
    UART7_DMA_RX_Handler.Init.Channel = DMA_CHANNEL_5;
    UART7_DMA_RX_Handler.Init.Direction =
        DMA_PERIPH_TO_MEMORY; /* 接收, 外设到内存 */
    UART7_DMA_RX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    UART7_DMA_RX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    UART7_DMA_RX_Handler.Init.Mode = DMA_CIRCULAR;
    UART7_DMA_RX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    UART7_DMA_RX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    UART7_DMA_RX_Handler.Init.Priority = DMA_PRIORITY_HIGH;

    HAL_DMA_Init(&UART7_DMA_RX_Handler);
    __HAL_LINKDMA(&UART7_Handler, hdmarx, UART7_DMA_RX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

            #if UART7_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&UART7_Handler, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&UART7_Handler);
            #endif /* UART7_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&UART7_Handler, (uint8_t *)g_uart7_recv_buf, buf_size);
}

/**
 * @brief 串口7接收中断句柄
 *
 */
void DMA1_Stream3_IRQHandler(void) {
    HAL_DMA_IRQHandler(&UART7_DMA_RX_Handler);
}
        #endif /* UART7_USE_DMA_RX */

    #endif /* EN_UART7 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口8 DMA
 * @{
 */

    #ifdef EN_UART8

        #if UART8_USE_DMA_TX

static DMA_HandleTypeDef UART8_DMA_TX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_tx_fifo_t g_uart8_tx_fifo = {0};
static uint8_t *g_uart8_send_buf;
/**
 * @brief 串口8发送DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 * @warning `fifo_size`必须是2的幂次方
 */
void UART8_TX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_uart8_send_buf = (uint8_t *)malloc((sizeof(uint8_t)) * buf_size);
    g_uart8_tx_fifo.send_buf = g_uart8_send_buf;
    g_uart8_tx_fifo.send_buf_size = buf_size;
    g_uart8_tx_fifo.tc_flag = 1;
    g_uart8_tx_fifo.tx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));

    g_uart8_tx_fifo.tx_fifo =
        ring_fifo_init(g_uart8_tx_fifo.tx_fifo_buf, fifo_size, RF_TYPE_STREAM);
    if (g_uart8_tx_fifo.tx_fifo_buf == NULL) {
        printf("UART8 TX FIFO Init Failed. \r\n");
        while (1)
            ;
    }

    __HAL_RCC_DMA1_CLK_ENABLE();
    UART8_DMA_TX_Handler.Instance = DMA1_Stream0;
    UART8_DMA_TX_Handler.Init.Channel = DMA_CHANNEL_5;
    UART8_DMA_TX_Handler.Init.Direction =
        DMA_MEMORY_TO_PERIPH; /* 发送, 内存到外设 */
    UART8_DMA_TX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    UART8_DMA_TX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    UART8_DMA_TX_Handler.Init.Mode = DMA_NORMAL;
    UART8_DMA_TX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    UART8_DMA_TX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    UART8_DMA_TX_Handler.Init.Priority = DMA_PRIORITY_LOW;

    HAL_DMA_Init(&UART8_DMA_TX_Handler);
    __HAL_LINKDMA(&UART8_Handler, hdmatx, UART8_DMA_TX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
}
/**
 * @brief 串口8发送中断句柄
 *
 */
void DMA1_Stream0_IRQHandler(void) {
    HAL_DMA_IRQHandler(&UART8_DMA_TX_Handler);
}
        #endif /* UART8_USE_DMA_TX */

        #if UART8_USE_DMA_RX

static DMA_HandleTypeDef UART8_DMA_RX_Handler = {0};
/* FIFO+BUF, 双缓冲 */
static uart_rx_fifo_t g_uart8_rx_fifo = {0};
static uint8_t *g_uart8_recv_buf;

/**
 * @brief 串口8接收DMA初始化
 *
 * @param fifo_size 接收FIFO大小
 * @param buf_size 接收缓冲区大小
 */
void UART8_RX_DMA_Init(uint32_t fifo_size, uint32_t buf_size) {
    g_uart8_recv_buf = (uint8_t *)malloc((sizeof(uint8_t)) * (buf_size));
    g_uart8_rx_fifo.head_ptr = 0;
    g_uart8_rx_fifo.rx_fifo_buf =
        (uint8_t *)malloc((sizeof(uint8_t)) * (fifo_size));
    g_uart8_rx_fifo.rx_fifo =
        ring_fifo_init(g_uart8_rx_fifo.rx_fifo_buf,
                       (sizeof(uint8_t)) * (fifo_size), RF_TYPE_STREAM);
    if (g_uart8_rx_fifo.rx_fifo == NULL) {
        printf("UART8 RX FIFO Init Failed. \r\n");
        while (1)
            ;
    }
    __HAL_RCC_DMA1_CLK_ENABLE();

    UART8_DMA_RX_Handler.Instance = DMA1_Stream6;
    UART8_DMA_RX_Handler.Init.Channel = DMA_CHANNEL_5;
    UART8_DMA_RX_Handler.Init.Direction =
        DMA_PERIPH_TO_MEMORY; /* 接收, 外设到内存 */
    UART8_DMA_RX_Handler.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    UART8_DMA_RX_Handler.Init.MemInc = DMA_MINC_ENABLE;
    UART8_DMA_RX_Handler.Init.Mode = DMA_CIRCULAR;
    UART8_DMA_RX_Handler.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    UART8_DMA_RX_Handler.Init.PeriphInc = DMA_PINC_DISABLE;
    UART8_DMA_RX_Handler.Init.Priority = DMA_PRIORITY_HIGH;

    HAL_DMA_Init(&UART8_DMA_RX_Handler);
    __HAL_LINKDMA(&UART8_Handler, hdmarx, UART8_DMA_RX_Handler);

    HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);

            #if UART8_USE_IDLE_IT
    __HAL_UART_ENABLE_IT(&UART8_Handler, UART_IT_IDLE);
    __HAL_UART_CLEAR_IDLEFLAG(&UART8_Handler);
            #endif /* UART8_USE_IDLE_IT */
    HAL_UART_Receive_DMA(&UART8_Handler, (uint8_t *)g_uart8_recv_buf, buf_size);
}

/**
 * @brief 串口8接收中断句柄
 *
 */
void DMA1_Stream6_IRQHandler(void) {
    HAL_DMA_IRQHandler(&UART8_DMA_RX_Handler);
}
        #endif /* UART8_USE_DMA_RX */

    #endif /* EN_UART8 */

/**
 * @}
 */

#endif /* (defined(STM32F429xx) || defined(STM32F439xx))  */

