XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/dma_uart.c
/*******************************************************************************
 * @defgroup 公共处理函数
 * @{
 */

/**
 * @brief 从发送FIFO中读数据
 *
 * @param uart_fifo 串口发送FIFO
 * @return uint32_t 读出的长度
 */
static inline uint32_t UART_Read_TxFifo(uart_tx_fifo_t *uart_fifo) {
    return ring_fifo_read(uart_fifo->tx_fifo, uart_fifo->send_buf,
                          uart_fifo->send_buf_size);
}

/**
 * @brief 判断是那个串口, 指定到对应的发送FIFO
 *
 * @param huart 串口句柄
 * @return uart_tx_fifo_t* FIFO指针
 */
static inline uart_tx_fifo_t *UART_TX_Identify(UART_HandleTypeDef *huart) {
    /* 指定发送FIFO */
    if (huart->Instance == USART1) {
#if USART1_USE_DMA_TX
        return &g_usart1_tx_fifo;
#endif /* USART1_USE_DMA_TX */
    } else if (huart->Instance == USART2) {
#if USART2_USE_DMA_TX
        return &g_usart2_tx_fifo;
#endif /* USART2_USE_DMA_TX */
    } else if (huart->Instance == USART3) {
#if USART3_USE_DMA_TX
        return &g_usart3_tx_fifo;
#endif /* USART3_USE_DMA_TX */
    } else if (huart->Instance == UART4) {
#if UART4_USE_DMA_TX
        return &g_uart4_tx_fifo;
#endif /* UART4_USE_DMA_TX */
    } else if (huart->Instance == UART5) {
#if UART5_USE_DMA_TX
        return &g_uart5_tx_fifo;
#endif /* UART5_USE_DMA_TX */
    } else if (huart->Instance == USART6) {
#if USART6_USE_DMA_TX
        return &g_usart6_tx_fifo;
#endif /* USART6_USE_DMA_TX */
    } else if (huart->Instance == UART7) {
#if UART7_USE_DMA_TX
        return &g_uart7_tx_fifo;
#endif /* UART7_USE_DMA_TX */
    } else if (huart->Instance == UART8) {
#if UART8_USE_DMA_TX
        return &g_uart8_tx_fifo;
#endif /* UART8_USE_DMA_TX */
    }
    return NULL;
}

/**
 * @brief 清除发送完成标志位
 *
 * @param huart 串口句柄
 */
void UART_DMATX_Clear_TC_Flag(UART_HandleTypeDef *huart) {
    uart_tx_fifo_t *tx_fifo = UART_TX_Identify(huart);

    if (tx_fifo == NULL) {
        return;
    }

    tx_fifo->tc_flag = 1;
}

/**
 * @brief 向串口发送FIFO中写数据
 *
 * @param huart 串口句柄
 * @param data 数据
 * @param len 数据长度
 */
void UART_DMATX_Write(UART_HandleTypeDef *huart, const void *data,
                      uint32_t len) {
    if ((data == NULL) || (len == 0)) {
        return;
    }

    uart_tx_fifo_t *send_tx_fifo = UART_TX_Identify(huart);

    if (send_tx_fifo == NULL) {
        return;
    }

    uint32_t copied = ring_fifo_write(send_tx_fifo->tx_fifo, data, len);
    if (copied != len) {
        // printf("%s if full. \n", __FUNCTION__);
    }
}

/**
 * @brief 把FIFO中的数据通过DMA发送
 *
 * @param huart 串口句柄
 * @note 先使用`UART_DMARX_FIFO_Write`写入数据
 */
void UART_DMATX_Send(UART_HandleTypeDef *huart) {
    uart_tx_fifo_t *send_tx_fifo = UART_TX_Identify(huart);

    if (send_tx_fifo == NULL) {
        return;
    }

    /* 未发送完毕 */
    if (!send_tx_fifo->tc_flag) {
        return;
    }

    uint32_t len = UART_Read_TxFifo(send_tx_fifo);
    /* FIFO为空 */
    if (!len) {
        return;
    }

    if (huart->hdmatx == NULL) {
        printf("This uart is not enable DMA TX. \r\n");
        return;
    }
    send_tx_fifo->tc_flag = 0;
    HAL_UART_Transmit_DMA(huart, send_tx_fifo->send_buf, (uint16_t)len);
}

/**
 * @brief 向接收FIFO写数据
 *
 * @param uart_fifo 串口接收FIFO
 * @param data 要写入的数据
 * @param len 数据长度
 */
static inline void UART_Write_RxFifo(uart_rx_fifo_t *uart_fifo,
                                     const void *data, uint32_t len) {
    if ((data == NULL) || (len == 0)) {
        return;
    }

    uint32_t copied = ring_fifo_write(uart_fifo->rx_fifo, data, len);
    if (copied != len) {
        // printf("%s is full. \r\n", __FUNCTION__);
    }
}

/**
 * @brief 判断是那个串口, 指定到对应的接收FIFO
 *
 * @param huart 串口句柄
 * @return uart_rx_fifo_t* FIFO指针
 */
static inline uart_rx_fifo_t *UART_RX_Identify(UART_HandleTypeDef *huart) {
    /* 指定接收FIFO */
    if (huart->Instance == USART1) {
#if USART1_USE_DMA_RX
        return &g_usart1_rx_fifo;
#endif /* USART1_USE_DMA_RX */
    } else if (huart->Instance == USART2) {
#if USART2_USE_DMA_RX
        return &g_usart2_rx_fifo;
#endif /* USART2_USE_DMA_RX */
    } else if (huart->Instance == USART3) {
#if USART3_USE_DMA_RX
        return &g_usart3_rx_fifo;
#endif /* USART3_USE_DMA_RX */
    } else if (huart->Instance == UART4) {
#if UART4_USE_DMA_RX
        return &g_uart4_rx_fifo;
#endif /* UART4_USE_DMA_RX */
    } else if (huart->Instance == UART5) {
#if UART5_USE_DMA_RX
        return &g_uart5_rx_fifo;
#endif /* UART5_USE_DMA_RX */
    } else if (huart->Instance == USART6) {
#if USART6_USE_DMA_RX
        return &g_usart6_rx_fifo;
#endif /* USART6_USE_DMA_RX */
    } else if (huart->Instance == UART7) {
#if UART7_USE_DMA_RX
        return &g_uart7_rx_fifo;
#endif /* UART7_USE_DMA_RX */
    } else if (huart->Instance == UART8) {
#if UART8_USE_DMA_RX
        return &g_uart8_rx_fifo;
#endif /* UART8_USE_DMA_RX */
    }
    return NULL;
}

/**
 * @brief 串口接收空闲回调
 *
 * @param huart 串口句柄
 */
void UART_DMARX_Idle_Callback(UART_HandleTypeDef *huart) {
    uint32_t tail_ptr;
    uint32_t copy, offset;

    /*
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     * |     head_ptr          tail_ptr         |
     * |         |                 |            |
     * |         v                 v            |
     * | --------*******************----------- |
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     */

    /* 已接收 */
    tail_ptr = huart->RxXferSize - __HAL_DMA_GET_COUNTER(huart->hdmarx);

    uart_rx_fifo_t *uart_rx_fifo = UART_RX_Identify(huart);

    if (uart_rx_fifo == NULL) {
        return;
    }

    offset = (uart_rx_fifo->head_ptr) % (uint32_t)(huart->RxXferSize);
    copy = tail_ptr - offset;
    uart_rx_fifo->head_ptr += copy;

    UART_Write_RxFifo(uart_rx_fifo, huart->pRxBuffPtr + offset, copy);
}

/**
 * @brief DMA接收半满回调
 *
 * @param huart 串口句柄
 */
void UART_DMARX_HalfDone_Callback(UART_HandleTypeDef *huart) {
    uint32_t tail_ptr;
    uint32_t offset, copy;

    /*
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     * |                  half                  |
     * |     head_ptr   tail_ptr                |
     * |         |          |                   |
     * |         v          v                   |
     * | --------*******************----------- |
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     */

    tail_ptr = (huart->RxXferSize >> 1) + (huart->RxXferSize & 1);

    uart_rx_fifo_t *uart_rx_fifo = UART_RX_Identify(huart);

