XJU-Hurricane/STM32_Template/Little/f429/Drivers/bsp/Src/dma_uart.c
    if (uart_rx_fifo == NULL) {
        return;
    }

    offset = (uart_rx_fifo->head_ptr) % (uint32_t)(huart->RxXferSize);
    copy = tail_ptr - offset;
    uart_rx_fifo->head_ptr += copy;

    UART_Write_RxFifo(uart_rx_fifo, huart->pRxBuffPtr + offset, copy);
}

/**
 * @brief DMA溢满中断回调
 *
 * @param huart 串口句柄
 */
void UART_DMARX_Done_Callback(UART_HandleTypeDef *huart) {
    uint32_t tail_ptr;
    uint32_t offset, copy;

    /*
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     * |                  half                  |
     * |                    | head_ptr tail_ptr |
     * |                    |    |            | |
     * |                    v    v            v |
     * | ------------------------************** |
     * +~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+
     */

    tail_ptr = huart->RxXferSize;

    uart_rx_fifo_t *uart_rx_fifo = UART_RX_Identify(huart);

    if (uart_rx_fifo == NULL) {
        return;
    }

    offset = (uart_rx_fifo->head_ptr) % (uint32_t)(huart->RxXferSize);
    copy = tail_ptr - offset;
    uart_rx_fifo->head_ptr += copy;

    UART_Write_RxFifo(uart_rx_fifo, huart->pRxBuffPtr + offset, copy);
}
/**
 * @brief 从接收FIFO读数据
 *
 * @param huart 串口句柄
 * @param buf 接收缓冲数组
 * @param len `buf`长度
 * @return uint32_t 接收到的长度
 */
uint32_t UART_DMARX_Read(UART_HandleTypeDef *huart, void *buf, uint32_t len) {
    if ((buf == NULL) || (len == 0)) {
        return 0;
    }
    uart_rx_fifo_t *uart_rx_fifo = UART_RX_Identify(huart);

    if (uart_rx_fifo == NULL) {
        return 0;
    }

    return ring_fifo_read(uart_rx_fifo->rx_fifo, buf, len);
}

/**
 * @}
 */
